# Yahia Kamel Hussein

## What are the countries that have contributed the most and the least to climate change relief?

Based on the carbon dioxide emissions, forest coverage, and land for different countries over the past years. I will analyze which countries have contributed the most and least to aid the climate change crisis.

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pylab as plt
#Understanding my variables
import seaborn as sns

df1 = pd.read_csv('Carbon Dioxide Emission Estimates.csv')
df2 = pd.read_csv('Threatened Species.csv')
df3 = pd.read_csv('Land.csv')
df4 = pd.read_csv('Water and Sanitation Services.csv')

print(df1)
print(df2)
print(df3)
print(df4)

     CO2 emission estimates  Year  \
0                   Albania  1975
1                   Albania  1985
2                   Albania  1995
3                   Albania  2005
4                   Albania  2010
...                     ...   ...
2127               Zimbabwe  2005
2128               Zimbabwe  2010
2129               Zimbabwe  2015
2130               Zimbabwe  2016
2131               Zimbabwe  2017

                                                 Series     Value
0     Emissions (thousand metric tons of carbon diox...  4338.334
1     Emissions (thousand metric tons of carbon diox...  6929.926
2     Emissions (thousand metric tons of carbon diox...  1848.549
3     Emissions (thousand metric tons of carbon diox...  3825.184
4     Emissions (thousand metric tons of carbon diox...  3930.295
...                                                 ...       ...
2127  Emissions per capita (metric tons of carbon di...     0.794
2128  Emissions per capita (metric tons of carbon di...     0.672
2129  Emissions per capita (metric tons of carbon di...     0.749
2130  Emissions per capita (metric tons of carbon di...     0.642
2131  Emissions per capita (metric tons of carbon di...     0.588

[2132 rows x 4 columns]
     Threatened species  Year                                    Series  Value
0           Afghanistan  2004  Threatened Species: Vertebrates (number)     31
1           Afghanistan  2010  Threatened Species: Vertebrates (number)     31
2           Afghanistan  2016  Threatened Species: Vertebrates (number)     35
3           Afghanistan  2017  Threatened Species: Vertebrates (number)     35
4           Afghanistan  2018  Threatened Species: Vertebrates (number)     34
...                 ...   ...                                       ...    ...
6913           Zimbabwe  2016        Threatened Species: Total (number)     61
6914           Zimbabwe  2017        Threatened Species: Total (number)     89
6915           Zimbabwe  2018        Threatened Species: Total (number)     95
6916           Zimbabwe  2019        Threatened Species: Total (number)    103
6917           Zimbabwe  2020        Threatened Species: Total (number)    122

[6918 rows x 4 columns]
                               Land  Year  \
0     Total, all countries or areas  2005
1     Total, all countries or areas  2005
2     Total, all countries or areas  2005
3     Total, all countries or areas  2005
4     Total, all countries or areas  2005
...                             ...   ...
6154                       Zimbabwe  2017
6155                       Zimbabwe  2017
6156                       Zimbabwe  2017
6157                       Zimbabwe  2017
6158                       Zimbabwe  2019

                                                 Series         Value
0                         Land area (thousand hectares)  1.299769e+07
1                       Arable land (thousand hectares)  1.356869e+06
2                   Permanent crops (thousand hectares)  1.456805e+05
3                      Forest cover (thousand hectares)  4.032743e+06
4                    Arable land (% of total land area)  1.043930e+01
...                                                 ...           ...
6154                 Arable land (% of total land area)  1.033990e+01
6155             Permanent crops (% of total land area)  2.585000e-01
6156                Forest cover (% of total land area)  3.635000e+01
6157  Important sites for terrestrial biodiversity p...  8.121760e+01
6158  Important sites for terrestrial biodiversity p...  8.121760e+01

[6159 rows x 4 columns]
     Water supply and sanitation services  Year  \
0           Total, all countries or areas  2005
1           Total, all countries or areas  2005
2           Total, all countries or areas  2005
3           Total, all countries or areas  2005
4           Total, all countries or areas  2005
...                                   ...   ...
1517                               Zambia  2010
1518                               Zambia  2017
1519                             Zimbabwe  2005
1520                             Zimbabwe  2010
1521                             Zimbabwe  2017

                                                 Series    Value
0     Safely managed drinking water sources, urban (...  86.1804
1     Safely managed drinking water sources, rural (...  43.0323
2     Safely managed drinking water sources, total (...  64.2425
3     Safely managed sanitation facilities, urban (P...  37.0176
4     Safely managed sanitation facilities, rural (P...  26.0720
...                                                 ...      ...
1517  Safely managed drinking water sources, urban (...  47.0679
1518  Safely managed drinking water sources, urban (...  46.2452
1519  Safely managed sanitation facilities, urban (P...  22.3062
1520  Safely managed sanitation facilities, urban (P...  19.7990
1521  Safely managed sanitation facilities, urban (P...  16.2922

[1522 rows x 4 columns]

In [ ]:
#Understanding my Carbon Dioxide Dataset

print("Carbon Dioxide Emissions dataset shape: ",df1.shape)
print("Head: ", df1.head())
print("Columns: ", df1.columns)

df1.nunique(axis=0)
df1.describe().apply(lambda s: s.apply(lambda x: format(x, 'f')))

Carbon Dioxide Emissions dataset shape:  (2132, 4)
Head:    Countries  Year                                             Series  \
0   Albania  1975  Emissions (thousand metric tons of carbon diox...
1   Albania  1985  Emissions (thousand metric tons of carbon diox...
2   Albania  1995  Emissions (thousand metric tons of carbon diox...
3   Albania  2005  Emissions (thousand metric tons of carbon diox...
4   Albania  2010  Emissions (thousand metric tons of carbon diox...

   Emissions
0   4338.334
1   6929.926
2   1848.549
3   3825.184
4   3930.295
Columns:  Index(['Countries', 'Year', 'Series', 'Emissions'], dtype='object')

              Year       Emissions
count  2132.000000     2132.000000
mean   2003.532833    91479.161849
std      14.096781   530003.714200
min    1975.000000        0.023000
25%    1995.000000        3.254750
50%    2010.000000       50.215500
75%    2016.000000    23550.187500
max    2017.000000  9257933.900000

In [ ]:
#Understanding my Threatened Species Dataset
print("Threatened Species dataset shape: ",df2.shape)
print("Head: ", df2.head())
print("Columns: ", df2.columns)

df2.nunique(axis=0)
df2.describe().apply(lambda s: s.apply(lambda x: format(x, 'f')))

Threatened Species dataset shape:  (6918, 4)
Head:       Countries  Year                                    Series  \
0  Afghanistan  2004  Threatened Species: Vertebrates (number)
1  Afghanistan  2010  Threatened Species: Vertebrates (number)
2  Afghanistan  2016  Threatened Species: Vertebrates (number)
3  Afghanistan  2017  Threatened Species: Vertebrates (number)
4  Afghanistan  2018  Threatened Species: Vertebrates (number)

   Number of Species
0                 31
1                 31
2                 35
3                 35
4                 34
Columns:  Index(['Countries', 'Year', 'Series', 'Number of Species'], dtype='object')

              Year Number of Species
count  6918.000000       6918.000000
mean   2014.935964         90.783897
std       5.303873        189.623765
min    2004.000000          0.000000
25%    2010.000000         10.000000
50%    2017.000000         36.000000
75%    2019.000000         89.000000
max    2020.000000       2910.000000

In [ ]:
#Understanding my Land Dataset

print("Land dataset shape: ",df3.shape)
print("Head: ", df3.head())
print("Columns: ", df3.columns)

df3.nunique(axis=0)
df3.describe().apply(lambda s: s.apply(lambda x: format(x, 'f')))

Land dataset shape:  (6159, 4)
Head:                              Land  Year                               Series  \
0  Total, all countries or areas  2005        Land area (thousand hectares)
1  Total, all countries or areas  2005      Arable land (thousand hectares)
2  Total, all countries or areas  2005  Permanent crops (thousand hectares)
3  Total, all countries or areas  2005     Forest cover (thousand hectares)
4  Total, all countries or areas  2005   Arable land (% of total land area)

          Value
0  1.299769e+07
1  1.356869e+06
2  1.456805e+05
3  4.032743e+06
4  1.043930e+01
Columns:  Index(['Land', 'Year', 'Series', 'Value'], dtype='object')

              Year            Value
count  6159.000000      6159.000000
mean   2010.980841     39961.822894
std       5.080031    360904.819472
min    2005.000000         0.000000
25%    2005.000000         7.858650
50%    2010.000000        39.541300
75%    2017.000000      1148.285000
max    2019.000000  13002855.208000

In [ ]:
#Understanding my Water and Sanitation Services Dataset

print("Water and Sanitation Services dataset shape: ",df4.shape)
print("Head: ", df4.head())
print("Columns: ", df4.columns)

df4.nunique(axis=0)
df4.describe().apply(lambda s: s.apply(lambda x: format(x, 'f')))

Water and Sanitation Services dataset shape:  (1522, 4)
Head:    Water supply and sanitation services  Year  \
0        Total, all countries or areas  2005
1        Total, all countries or areas  2005
2        Total, all countries or areas  2005
3        Total, all countries or areas  2005
4        Total, all countries or areas  2005

                                              Series    Value
0  Safely managed drinking water sources, urban (...  86.1804
1  Safely managed drinking water sources, rural (...  43.0323
2  Safely managed drinking water sources, total (...  64.2425
3  Safely managed sanitation facilities, urban (P...  37.0176
4  Safely managed sanitation facilities, rural (P...  26.0720
Columns:  Index(['Water supply and sanitation services', 'Year', 'Series', 'Value'], dtype='object')

              Year        Value
count  1522.000000  1522.000000
mean   2010.704336    63.538700
std       4.922740    30.460657
min    2000.000000     0.512600
25%    2005.000000    37.115550
50%    2010.000000    69.565450
75%    2017.000000    92.907750
max    2017.000000   100.000000

In [ ]:
#Cleaning datasets for the years column to be between 2005 and 2017 and remove the outliers

df1_cleaned = df1[(df1['Year'] >= 2010) & (df1['Year'] <= 2017)]
df2_cleaned = df2[(df2['Year'] >= 2010) & (df2['Year'] <= 2017)]
df3_cleaned = df3[(df3['Year'] >= 2010) & (df3['Year'] <= 2017)]
df4_cleaned = df4[(df4['Year'] >= 2010) & (df4['Year'] <= 2017)]

print(df1_cleaned.describe().apply(lambda s: s.apply(lambda x: format(x, 'f'))))
print(df2_cleaned.describe().apply(lambda s: s.apply(lambda x: format(x, 'f'))))
print(df3_cleaned.describe().apply(lambda s: s.apply(lambda x: format(x, 'f'))))
print(df4_cleaned.describe().apply(lambda s: s.apply(lambda x: format(x, 'f'))))

              Year       Emissions
count  1132.000000     1132.000000
mean   2014.515901   107810.194688
std       2.685178   626120.089145
min    2010.000000        0.025000
25%    2015.000000        3.543250
50%    2016.000000      252.739000
75%    2017.000000    29682.650000
max    2017.000000  9257933.900000
              Year Number of Species
count  2976.000000       2976.000000
mean   2014.350806         86.352823
std       3.085654        175.320911
min    2010.000000          0.000000
25%    2010.000000         10.000000
50%    2016.000000         36.000000
75%    2017.000000         86.000000
max    2017.000000       2358.000000
              Year            Value
count  3954.000000      3954.000000
mean   2013.494689     41476.545122
std       3.500439    367642.056685
min    2010.000000         0.000000
25%    2010.000000         7.580425
50%    2010.000000        40.166700
75%    2017.000000      1391.397750
max    2017.000000  13002855.208000
              Year        Value
count  1022.000000  1022.000000
mean   2013.500000    65.179853
std       3.501714    29.978488
min    2010.000000     1.741700
25%    2010.000000    39.500975
50%    2013.500000    72.886000
75%    2017.000000    93.348750
max    2017.000000   100.000000

In [ ]:
#Dropping rows with null values

df1_cleaned = df1_cleaned.dropna(axis=0)
print("New Shape for Carbon Dioxide Emissions dataset: ", df1_cleaned.shape)

df2_cleaned = df2_cleaned.dropna(axis=0)
print("New Shape for Threatened Species dataset: ", df2_cleaned.shape)

df3_cleaned = df3_cleaned.dropna(axis=0)
print("New Shape for Land dataset: ", df3_cleaned.shape)

df4_cleaned = df4_cleaned.dropna(axis=0)
print("New Shape for Water and Sanitation Services dataset: ", df4_cleaned.shape)

New Shape for Carbon Dioxide Emissions dataset:  (1132, 4)
New Shape for Threatened Species dataset:  (2976, 4)
New Shape for Land dataset:  (3954, 4)
New Shape for Water and Sanitation Services dataset:  (1022, 4)

In [ ]:
#merging datasets 1 and 2 + renaming columns

df1.rename(columns = {'Value' : 'Emissions'}, inplace = True)
df2.rename(columns = {'Value' : 'Number of Species'}, inplace = True)
df1.rename(columns = {'CO2 emission estimates' : 'Countries'}, inplace = True)
df2.rename(columns = {'Threatened species' : 'Countries'}, inplace = True)



carbon_threatened = pd.merge(df1, df2, how = "outer")
carbon_threatened
#Merge dataframes and keep only overlapping rows

overlapping_carbon_threatened = df1.merge(df2, left_on = 'Emissions', right_on = 'Number of Species', how = 'inner')